result/c6620/c6620_histogram_not_consolidated/baseline/run9.txt
# run=9/10
# 2026-04-01T01:23:23-06:00
# cmd: taskset -c 1-55 sysbench oltp_read_write --mysql-db=sbtest --tables=1 --table_size=100 --threads=32 --time=60 --rand-type=pareto run

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
       1.392 |                                         1
       1.417 |                                         1
       1.469 |                                         1
       1.496 |                                         1
       1.523 |                                         1
       1.551 |                                         2
       1.579 |                                         4
       1.608 |                                         9
       1.637 |                                         8
       1.667 |                                         12
       1.697 |                                         13
       1.728 |*                                        21
       1.759 |                                         11
       1.791 |*                                        28
       1.824 |*                                        24
       1.857 |*                                        32
       1.891 |*                                        45
       1.925 |                                         19
       1.960 |*                                        35
       1.996 |*                                        34
       2.032 |*                                        56
       2.069 |*                                        40
       2.106 |*                                        51
       2.145 |*                                        44
       2.184 |*                                        41
       2.223 |**                                       61
       2.264 |*                                        56
       2.305 |**                                       63
       2.347 |**                                       59
       2.389 |*                                        55
       2.433 |*                                        46
       2.477 |*                                        58
       2.522 |**                                       64
       2.568 |**                                       60
       2.615 |**                                       60
       2.662 |**                                       64
       2.710 |**                                       69
       2.760 |*                                        52
       2.810 |*                                        56
       2.861 |**                                       61
       2.913 |*                                        53
       2.966 |**                                       63
       3.020 |**                                       64
       3.075 |*                                        56
       3.130 |**                                       62
       3.187 |*                                        48
       3.245 |*                                        43
       3.304 |*                                        53
       3.364 |**                                       69
       3.425 |*                                        55
       3.488 |**                                       62
       3.551 |*                                        55
       3.615 |**                                       66
       3.681 |**                                       67
       3.748 |*                                        54
       3.816 |**                                       67
       3.885 |**                                       63
       3.956 |*                                        56
       4.028 |*                                        57
       4.101 |**                                       61
       4.176 |**                                       60
       4.252 |**                                       71
       4.329 |**                                       68
       4.407 |**                                       71
       4.487 |*                                        54
       4.569 |**                                       59
       4.652 |**                                       75
       4.737 |**                                       69
       4.823 |**                                       71
       4.910 |*                                        58
       4.999 |**                                       71
       5.090 |**                                       74
       5.183 |**                                       68
       5.277 |**                                       67
       5.373 |**                                       79
       5.470 |**                                       75
       5.570 |**                                       73
       5.671 |**                                       78
       5.774 |**                                       76
       5.879 |**                                       70
       5.986 |**                                       96
       6.095 |**                                       74
       6.205 |**                                       65
       6.318 |**                                       88
       6.433 |**                                       89
       6.550 |**                                       78
       6.669 |**                                       87
       6.790 |**                                       82
       6.913 |***                                      100
       7.039 |**                                       92
       7.167 |**                                       86
       7.297 |**                                       93
       7.430 |**                                       83
       7.565 |**                                       78
       7.702 |**                                       84
       7.842 |***                                      97
       7.985 |**                                       77
       8.130 |**                                       73
       8.277 |**                                       80
       8.428 |**                                       85
       8.581 |**                                       90
       8.737 |**                                       86
       8.895 |***                                      106
       9.057 |**                                       81
       9.222 |***                                      102
       9.389 |**                                       74
       9.560 |**                                       81
       9.734 |**                                       66
       9.910 |**                                       91
      10.090 |**                                       83
      10.274 |**                                       81
      10.460 |**                                       82
      10.651 |**                                       79
      10.844 |**                                       81
      11.041 |**                                       73
      11.242 |**                                       73
      11.446 |**                                       69
      11.654 |**                                       84
      11.866 |**                                       74
      12.081 |**                                       69
      12.301 |**                                       84
      12.524 |**                                       81
      12.752 |**                                       71
      12.984 |**                                       64
      13.219 |**                                       84
      13.460 |**                                       81
      13.704 |**                                       76
      13.953 |**                                       69
      14.207 |**                                       95
      14.465 |**                                       76
      14.728 |**                                       71
      14.995 |**                                       79
      15.268 |**                                       76
      15.545 |**                                       69
      15.828 |**                                       75
      16.115 |**                                       76
      16.408 |**                                       82
      16.706 |**                                       80
      17.010 |**                                       81
      17.319 |**                                       68
      17.633 |**                                       82
      17.954 |**                                       80
      18.280 |**                                       86
      18.612 |**                                       73
      18.950 |**                                       67
      19.295 |**                                       85
      19.645 |**                                       73
      20.002 |**                                       72
      20.366 |**                                       89
      20.736 |**                                       65
      21.112 |**                                       81
      21.496 |**                                       65
      21.886 |***                                      97
      22.284 |**                                       66
      22.689 |**                                       68
      23.101 |**                                       82
      23.521 |**                                       71
      23.948 |**                                       69
      24.384 |**                                       69
      24.827 |**                                       61
      25.278 |**                                       80
      25.737 |**                                       62
      26.205 |**                                       90
      26.681 |**                                       74
      27.165 |**                                       79
      27.659 |**                                       73
      28.162 |**                                       73
      28.673 |**                                       64
      29.194 |**                                       82
      29.725 |**                                       64
      30.265 |***                                      102
      30.815 |***                                      113
      31.375 |***                                      120
      31.945 |***                                      112
      32.525 |****                                     141
      33.116 |****                                     161
      33.718 |****                                     167
      34.330 |******                                   214
      34.954 |*******                                  288
      35.589 |********                                 314
      36.236 |**********                               404
      36.894 |************                             458
      37.565 |**************                           561
      38.247 |****************                         610
      38.942 |*******************                      722
      39.650 |*********************                    813
      40.370 |************************                 938
      41.104 |****************************             1074
      41.851 |******************************           1166
      42.611 |*********************************        1292
      43.385 |***********************************      1343
      44.173 |************************************     1402
      44.976 |**************************************   1466
      45.793 |*************************************    1444
      46.625 |*************************************    1439
      47.472 |**************************************** 1551
      48.335 |*************************************    1434
      49.213 |*************************************    1434
      50.107 |*********************************        1265
      51.018 |*******************************          1192
      51.945 |***************************              1066
      52.889 |**************************               997
      53.850 |************************                 914
      54.828 |********************                     769
      55.824 |****************                         616
      56.839 |***************                          566
      57.871 |*************                            500
      58.923 |**********                               397
      59.993 |*********                                333
      61.083 |*******                                  257
      62.193 |*****                                    209
      63.323 |*****                                    181
      64.474 |****                                     147
      65.645 |***                                      106
      66.838 |***                                      109
      68.053 |**                                       91
      69.289 |**                                       88
      70.548 |**                                       70
      71.830 |**                                       78
      73.135 |**                                       73
      74.464 |**                                       77
      75.817 |**                                       79
      77.194 |**                                       80
      78.597 |**                                       79
      80.025 |**                                       84
      81.479 |***                                      115
      82.959 |***                                      124
      84.467 |****                                     165
      86.002 |****                                     167
      87.564 |****                                     170
      89.155 |****                                     164
      90.775 |****                                     174
      92.424 |*****                                    197
      94.104 |*****                                    182
      95.814 |*****                                    185
      97.555 |*****                                    183
      99.327 |****                                     145
     101.132 |****                                     151
     102.969 |***                                      112
     104.840 |***                                      111
     106.745 |**                                       94
     108.685 |**                                       71
     110.659 |*                                        55
     112.670 |*                                        41
     114.717 |*                                        37
     116.802 |*                                        27
     118.924 |*                                        28
     121.085 |                                         14
     123.285 |*                                        31
     125.525 |*                                        25
     127.805 |                                         17
     130.128 |*                                        27
     132.492 |                                         19
     134.899 |*                                        20
     137.350 |*                                        33
     139.846 |*                                        27
     142.387 |                                         13
     144.974 |                                         18
     147.608 |*                                        24
     150.290 |                                         16
     153.021 |                                         10
     155.801 |                                         9
     158.632 |                                         8
     161.514 |                                         2
     164.449 |                                         3
     167.437 |                                         3
     170.479 |                                         2
     173.577 |                                         4
     176.731 |                                         1
     179.942 |                                         1
     183.211 |                                         4
     186.540 |                                         1
     193.380 |                                         2
     196.894 |                                         1
     200.472 |                                         2
     204.114 |                                         2
     211.599 |                                         1
     215.443 |                                         2
     292.601 |                                         1
 
SQL statistics:
    queries performed:
        read:                            739340
        write:                           192022
        other:                           98628
        total:                           1029990
    transactions:                        45818  (763.31 per sec.)
    queries:                             1029990 (17159.29 per sec.)
    ignored errors:                      6992   (116.48 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      763.3124
    time elapsed:                        60.0252s
    total number of events:              45818

Latency (ms):
         min:                                    1.38
         avg:                                   41.91
         max:                                  290.71
         95th percentile:                       89.16
         sum:                              1920231.16

Threads fairness:
    events (avg/stddev):           1431.8125/16.25
    execution time (avg/stddev):   60.0072/0.01